package leetcode.QueueAndStack;

import com.alibaba.fastjson.JSONObject;
import org.junit.Test;

import java.util.*;

/**
 * \* Created: liuhuichao
 * \* Date: 2019/7/4
 * \* Time: 31:19 PM
 * \* Description: 打开转盘锁
 * \
 * 你有一个带有四个圆形拨轮的转盘锁。每个拨轮都有10个数字： '0', '1', '2', '3', '4', '5', '6', '7', '8', '9' 。
 * 每个拨轮可以自由旋转：例如把 '9' 变为  '0'，'0' 变为 '9' 。每次旋转都只能旋转一个拨轮的一位数字。
 * <p>
 * 锁的初始数字为 '0000' ，一个代表四个拨轮的数字的字符串。
 * <p>
 * 列表 deadends 包含了一组死亡数字，一旦拨轮的数字和列表里的任何一个元素相同，这个锁将会被永久锁定，无法再被旋转。
 * <p>
 * 字符串 target 代表可以解锁的数字，你需要给出最小的旋转次数，如果无论如何不能解锁，返回 -1。
 * <p>
 *  
 * <p>
 * 示例 1:
 * <p>
 * 输入：deadends = ["0201","0101","0102","1212","2002"], target = "0202"
 * 输出：6
 * 解释：
 * 可能的移动序列为 "0000" -> "1000" -> "1100" -> "1200" -> "1201" -> "1202" -> "0202"。
 * 注意 "0000" -> "0001" -> "0002" -> "0102" -> "0202" 这样的序列是不能解锁的，
 * 因为当拨动到 "0102" 时这个锁就会被锁定。
 * 示例 2:
 * <p>
 * 输入: deadends = ["8888"], target = "0009"
 * 输出：1
 * 解释：
 * 把最后一位反向旋转一次即可 "0000" -> "0009"。
 * 示例 3:
 * <p>
 * 输入: deadends = ["8887","8889","8878","8898","8788","8988","7888","9888"], target = "8888"
 * 输出：-1
 * 解释：
 * 无法旋转到目标数字且不被锁定。
 * 示例 4:
 * <p>
 * 输入: deadends = ["0000"], target = "8888"
 * 输出：-1
 *  
 * <p>
 * 提示：
 * <p>
 * 死亡列表 deadends 的长度范围为 [1, 500]。
 * 目标数字 target 不会在 deadends 之中。
 * 每个 deadends 和 target 中的字符串的数字会在 10,000 个可能的情况 '0000' 到 '9999' 中产生。
 * <p>
 */
public class A752_OpenTheLock {
    public int openLock(String[] deadends, String target) {
        Set<String> deadEndsList = new HashSet(Arrays.asList(deadends));
        if (deadEndsList.contains("0000")) {
            return -1;
        }
        Queue<String> q = new LinkedList<>();
        q.add("0000");
        int step = 0;
        Set<String> used = new HashSet<>();
        while (!q.isEmpty()) {
            step++;
            int size = q.size();
            System.out.println((step) + "=" + JSONObject.toJSONString(q));
            for (int i = 0; i < size; i++) {
                String data = q.poll();
                if (deadEndsList.contains(data)) {
                    continue;
                }
                if (target.equals(data)) {
                    return step - 1;
                }
                char[] charArray = data.toCharArray();
                String n1 = String.valueOf(Character.digit(charArray[0], 9) + 1) + data.substring(1);
                String n2 = data.substring(0, 1) + String.valueOf(Character.digit(charArray[1], 9) + 1) + data.substring(2);
                String n3 = data.substring(0, 2) + String.valueOf(Character.digit(charArray[2], 9) + 1) + data.substring(3);
                String n4 = data.substring(0, 3) + String.valueOf(Character.digit(charArray[3], 9) + 1);
                String n5 = String.valueOf((Character.digit(charArray[0], 10) - 1) >= 0 ? Character.digit(charArray[0], 10) - 1 : 9) + data.substring(1);
                String n6 = data.substring(0, 1) + String.valueOf((Character.digit(charArray[1], 10) - 1) >= 0 ? Character.digit(charArray[1], 10) - 1 : 9) + data.substring(2);
                String n7 = data.substring(0, 2) + String.valueOf((Character.digit(charArray[2], 10) - 1) >= 0 ? Character.digit(charArray[2], 10) - 1 : 9) + data.substring(3);
                String n8 = data.substring(0, 3) + String.valueOf((Character.digit(charArray[3], 10) - 1) >= 0 ? Character.digit(charArray[3], 10) - 1 : 9);
                if (!used.contains(n8) && !deadEndsList.contains(n8)) {
                    q.add(n8);
                    used.add(n8);
                }
                if (!used.contains(n7) && !deadEndsList.contains(n7)) {
                    q.add(n7);
                    used.add(n7);
                }
                if (!used.contains(n6) && !deadEndsList.contains(n6)) {
                    q.add(n6);
                    used.add(n6);
                }
                if (!used.contains(n5) && !deadEndsList.contains(n5)) {
                    q.add(n5);
                    used.add(n5);
                }
                if (!used.contains(n4) && !deadEndsList.contains(n4)) {
                    q.add(n4);
                    used.add(n4);
                }
                if (!used.contains(n3) && !deadEndsList.contains(n3)) {
                    q.add(n3);
                    used.add(n3);
                }
                if (!used.contains(n2) && !deadEndsList.contains(n2)) {
                    q.add(n2);
                    used.add(n2);

                }
                if (!used.contains(n1) && !deadEndsList.contains(n1)) {
                    q.add(n1);
                    used.add(n1);
                }
                if (used.size() > 10000) {
                    return -1;
                }

            }
        }
        return -1;
    }

    @Test
    public void test() {
        long begin = System.currentTimeMillis();
       /* String[] deadends = {"0201", "0101", "0102", "1212", "2002"};
        String target = "0202";*/
       /* String[] deadends = {"8888"};
        String target = "0009";*/
       /* String[] deadends = {"8887", "8889", "8878", "8898", "8788", "8988", "7888", "9888"};
        String target = "8888";*/

        String[] deadends = {"8687", "6666", "7686", "8876", "7676", "6777", "6876", "8776", "8768", "8776", "6776", "7677", "6676", "7786", "7768", "7678", "7888", "6887", "8788", "8887", "8866", "8886", "7876", "8767", "8787", "6767", "8788", "6776", "6786", "8677", "8687", "7868", "8668", "7676", "7668", "7768", "7787", "8876", "7876", "7677", "8687", "7768", "7768", "6776", "6887", "6766", "8687", "6678", "6668", "7687", "6686", "8676", "7787", "7877", "8766", "7787", "7867", "6778", "7767", "8876", "6688", "8778", "6776", "6776", "8768", "8867", "7876", "8678", "6666", "6678", "6787", "6676", "6777", "7676", "7786", "6778", "6776", "6888", "7866", "8677", "8876", "8886", "8776", "6777", "8787", "7787", "6678", "7677", "8678", "8686", "8866", "7877", "7678", "6886", "7876", "7687", "6666", "7786", "7767", "7686", "6887", "6678", "7886", "7678", "6878", "6678", "7868", "6677", "7877", "8768", "7688", "7766", "6688", "8786", "7877", "8767", "6878", "7767", "7678", "8676", "6677", "8887", "8687", "8778", "6666", "6866", "7788", "7766", "6778", "8668", "8677", "7666", "6687", "6668", "6788", "6878", "8668", "7676", "6768", "7887", "8676", "8876", "6767", "6887", "6886", "7866", "7886", "6687", "6687", "8778", "6787", "6767", "8688", "7686", "7678", "6686", "8876", "7777", "7786", "8668", "7666", "7788", "7876", "8766", "7777", "6876", "7868", "8878", "6677", "7666", "7777", "8867", "8767", "6768", "7767", "7866", "6766", "8878", "6777", "8886", "7886", "7776", "7786", "8668", "7768", "7867", "6686", "6786", "6777", "7768", "6678", "8867", "6866", "8888", "7667", "7887", "8786", "8887", "6877", "6677", "6886", "8877", "8677", "6667", "8766", "6677", "7668", "8888", "6776", "6668", "6866", "7667", "7886", "7886", "7788", "6678", "7767", "8686", "6776", "7676", "6866", "6886", "6786", "6686", "7676", "8886", "7666", "7776", "8877", "6666", "6867", "8887", "6687", "7776", "6888", "8888", "7776", "8767", "8767", "6868", "7766", "7867", "7777", "7667", "6867", "7888", "6777", "6686", "6666", "7786", "7878", "7686", "7666", "8876", "8686", "7688", "8766", "8887", "6776", "8686", "8686", "7788", "8887", "7778", "7886", "7676", "7668", "8666", "8677", "7866", "6676", "6888", "6868", "7687", "7687", "6887", "7786", "6677", "6788", "8777", "8686", "6776", "6887", "6867", "8778", "6867", "8768", "7687", "8787", "8778", "6668", "6787", "6766", "6678", "6667", "7667", "8788", "7686", "7887", "6868", "7676", "8668", "6786", "7778", "8778", "8867", "7787", "7786", "7667", "8867", "7888", "8678", "6678", "6778", "6767", "8666", "8666", "7867", "8677", "8676", "6867", "7877", "7888", "6677", "7888", "8666", "8788", "7866", "8668", "7787", "7787", "6776", "8767", "6886", "6777", "6887", "8788", "7877", "7766", "6787", "8688", "7867", "8777", "6668", "8767", "6686", "7888", "7867", "7776", "6668", "8687", "8666", "7768", "8768", "6678", "8786", "6668", "6777", "8788", "6686", "8686", "8867", "6676", "7787", "7866", "6767", "6786", "8868", "8886", "6678", "7868", "7767", "8668", "8787", "7778", "7687", "6877", "8688", "6787", "7887", "6788", "6688", "8768", "8678", "8887", "6887", "6888", "7678", "8886", "6766", "7676", "7786", "6788", "8777", "7666", "6687", "6687", "6887", "7867", "8677", "6787", "7786", "8788", "8886", "6686", "7887", "6678", "8676", "7887", "8688", "7667", "8768", "7788", "6687", "7876", "7686", "8776", "7688", "8868", "8777", "6668", "8768", "7686", "7776", "6868", "8886", "8866", "6777", "7876", "7668", "8676", "8668", "8676", "6878", "7867", "6878", "6676", "8688", "8866", "7666", "8776", "7666", "6876", "7867", "8876", "8666", "8666", "7687", "6766", "6687", "7776", "8766", "6777", "6687", "7767", "8676", "7768", "8786", "7788", "6788", "8786", "6686", "6676", "8876", "7787", "6787", "8886", "6687", "7886", "8687", "6878", "6667", "6787", "8676", "6676", "6888", "6677", "8876", "8778", "6676", "7677", "8677", "6667", "7687", "7667", "7878", "7788", "7767", "8867", "7768", "7878", "7677", "8878", "7776", "6686", "8666", "8688", "8868", "7776", "6876"};
        String target = "8667";
        int result = openLock(deadends, target);
        System.out.println("result = " + result);
        long end = System.currentTimeMillis();
        long dif = end - begin;
        System.out.println("所用时间：" + dif);
    }

    @Test
    public void test1() {
        System.out.println(Character.digit('0', 9));
        System.out.println((Character.digit('9', 9) + 1));
        System.out.println(String.valueOf((Character.digit('9', 9) + 1)));
    }
}
